# 1.Створіть змінну lvl, яка містить наступні числові елементи: 8, 10, 10, 1, 10, 10, 8, 12, 1, 12. 
# Виконайте наступні завдання: 
#   обчисліть суму елементів lvl; 
#   обчисліть середнє елементів lvl; 
#   визначте медіану елементів lvl; 
#   визначте з допомогою R довжину змінної lvl; 
#   обчисліть стандартне відхилення елементів lvl; 
#   округліть стандартне відхилення до двох знаків після коми. 

lvl <- c(8, 10, 10, 1, 10, 10, 8, 12, 1, 12)
sum(lvl)
mean(lvl)
median(lvl)
length(lvl)
sd(lvl)
round(lvl)

# 2.Уявимо, що ви відстежуєте пробіг автомобіля після кожної заправки. 
# Після останніх восьмизаправок пробіг був: 65311 65624 65908 66219 66499 66821 67145 67447. 
# Введіть ці числа в R. Використайте функцію diff() до цих даних. 
# Що ви отримаєте як  результат?  Ви  повинні  побачити  кількість  миль  між  заправками. 
# Використайте функцію max(),  mean()  і  min(), щоб обчислити максимальний, 
# середній і мінімальний пробіг між заправками. 

run <- c(65311, 65624, 65908, 66219, 66499, 66821, 67145, 67447)
diff(run)
max(diff(run))
mean(diff(run))
min(diff(run))

# 3.Уявіть, що вам потрібно купити устаткування для вашої фабрики і у вас є 2 варіанти для вибору. 
# Перед прийняттям остаточного рішення, ви вибрали 10 показників ефективності з кожного варіанту. 
# Якщо б ваше остаточне рішення будувалося на цих замірах, яке устаткування ви б вибрали? 
# Устаткування 1: 151.2, 150.5, 149.2, 147.5, 152.9, 152.0, 151.3, 149.7, 149.4, 150.7 
# Устаткування 2: 151.9, 151.4, 150.3, 151.2, 151.0, 150.2, 151.2, 151.4, 150.4, 151.7

ust1 <- c(151.2, 150.5, 149.2, 147.5, 152.9, 152.0, 151.3, 149.7, 149.4, 150.7)
ust2 <- c(151.9, 151.4, 150.3, 151.2, 151.0, 150.2, 151.2, 151.4, 150.4, 151.7)

cat("Найкращим устаткуванням є :", ifelse(mean(ust1) > mean(ust2), "Устаткування 1", "Устаткування 2"))



# 4.Створіть вектор зросту двадцяти учнів класу: 
#   100, 106, 121, 111, 109, 111, 103, 117, 114, 108, 111, 105, 120, 116, 104, 103, 108, 111, 101, 120. 
# Який учень знаходиться посередині цього списку (за зростом)? Який зріст є  найбільш  популярним?
# Обчисліть ці  величини  засобами  описової аналітики в R. 

height <- c(100, 106, 121, 111, 109, 111, 103, 117, 114, 108, 111, 105, 120, 116, 104, 103, 108, 111, 101, 120)
sort(height)
cat("Зріст учня, який знаходиться посередині:", median(height))

find_mode <- function (x) {
  tab <- tabulate(match(x, unique(x)))
  unique(x)[tab == max(tab)]
}
print(paste("Найпопулярніший зріст:", find_mode(height)))


#5.Обчисліть квантилі, квартилі, IQR і стандартну похибку на основі даних з попереднього завдання. 

quantile(height)
IQR(height)
sd(height) / sqrt(length(height))

#6.Розрахуйте стандартне відхилення для даних із завдання 4 за допомогою формули і порівняйте 
#результати з використанням функції sd(). Чи будуть результати однакові?

sd(height)

sqrt(var(height))
  
# 7.Завантажте  дані  з  двох  стовпців  таблиці  у  два  вектори.  
# Визначте скошеність у даних візуально з використанням засобів розвідувальної 
# аналітики та  з  допомогою  метрикописової  аналітики.  Інтерпретуйте результати.

x <- c(212, 869, 220, 654, 511, 624, 420, 121, 428, 865, 799, 405, 230, 670, 870, 366, 99, 55, 489, 312, 493, 163, 221, 84, 144, 48, 375, 86, 168, 100)
y <- c(586, 760, 495, 678, 559, 415, 370, 659, 119, 288, 241, 787, 522, 207, 160, 526, 656, 848, 720, 676, 581, 929, 653, 611, 770, 800, 529, 975, 995, 947)

hist(x, col = "purple")
hist(y, col = "pink")

skewness(x)
skewness(y)
